Revit 2026 API

# IExportContext2DOnElementEnd2D Method

---

This method marks the end of an element being exported.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
void OnElementEnd2D(
	ElementNode node
)
```
```vb
Sub OnElementEnd2D (
	node As ElementNode
)
```
```cpp
void OnElementEnd2D(
	ElementNode^ node
)
```
```fsharp
abstract OnElementEnd2D :
        node : ElementNode -> unit
```

#### Parameters

node ElementNode
     An output node that represents an element.

For views having non-Wireframe display style, geometry of elements is output outside of view, instance and link begin/end brackets. Therefore the argument to this method is ElementNode that has both element ID and the host document.

#### Reference

IExportContext2D Interface

Autodesk.Revit.DB Namespace